import style from "./Route.module.scss";
import containerStyle from "../../../components/Container/Container.module.scss";
export const Route = () => {
  const routes = [
    {
      id: 1,
      text: "Від ст. м. «Святошино» - маршрутне таксі № 461 виходити на зупинці «Путопровід».",
    },
    {
      id: 2,
      text: `Від ст. м. «Академмістечко» — маршрутне таксі № 56, 56Д у напрямку Кільцевої дороги, повз завод «Електронмаш», зуп. 
             «Литвиненко-Вольгемут», минаючи поворот на Софіївську Борщагівку та Вишневе, зупинка одразу за Жулянським 
             мостом, виходити на зупинці «Путопровід».`,
    },
    {
      id: 3,
      text: `Від ст. м. «Васильківська» — маршрутне таксі № 208, 56Д,  904 у напрямку Кільцевої дороги, виходити на зупинці 
             «Путопровід».`,
    },
    {
      id: 4,
      text: `Від ст. м. (Виставкового центру) — автобус 56 та маршрутне  таксі № 208, 499, 461, 904 у напрямку Кільцевої дороги, 
             виходити на зупинці «Путепровід».`,
    },
    {
      id: 5,
      text: `Від м. Вишневе, маршрутним таксі 718, виходити на зупинці  (Путопровід).`,
    },
    {
      id: 6,
      text: `Від Севастопольської площі, маршрутне таксі 496, 499,  виходити на зупинці (Путопровід).`,
    },
  ];

  return (
    <section className={style.route}>
      <div className={`${containerStyle.container} ${style.route__container}`}>
        <h1 className={style.route__title}>
          Як дістатися до нашої виставки «Кровато» від метро:
        </h1>
        <ul className={style.route__list}>
          {routes.map((route, index) => (
            <li
              key={route.id}
              className={style.route__item}
              data-aos={index < 3 ? "fade-right" : "fade-left"}
              data-aos-duration="3000"
            >
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="32"
                height="32"
                viewBox="0 0 32 32"
                fill="none"
              >
                <path
                  d="M28.2023 3.81339C27.6929 3.29414 27.047 2.92968 26.3391 2.76215C25.6313 2.59463 24.8905 2.63088 24.2023 2.86672L5.33568 9.17339C4.57476 9.42246 3.90993 9.90158 3.43295 10.5446C2.95597 11.1877 2.69037 11.9629 2.67281 12.7634C2.65525 13.5638 2.88659 14.35 3.33491 15.0133C3.78324 15.6767 4.42642 16.1845 5.17568 16.4667L12.1623 19.1334C12.3214 19.1942 12.4663 19.2872 12.5879 19.4065C12.7095 19.5258 12.8052 19.6688 12.869 19.8267L15.5357 26.8267C15.8071 27.5654 16.2997 28.2024 16.9463 28.6509C17.5929 29.0995 18.3621 29.3378 19.149 29.3334H19.2423C20.0437 29.3188 20.8204 29.0538 21.4636 28.5756C22.1068 28.0974 22.5842 27.4299 22.829 26.6667L29.1357 7.77339C29.365 7.09197 29.3992 6.35998 29.2342 5.66017C29.0693 4.96036 28.7119 4.32066 28.2023 3.81339ZM26.669 6.93339L20.2957 25.8401C20.2217 26.0793 20.073 26.2887 19.8715 26.4374C19.67 26.5862 19.4262 26.6665 19.1757 26.6667C18.9267 26.6708 18.6823 26.599 18.4751 26.4609C18.2679 26.3227 18.1077 26.1248 18.0157 25.8934L15.349 18.8934C15.1557 18.3848 14.8575 17.9225 14.4739 17.5366C14.0903 17.1507 13.6298 16.8497 13.1223 16.6534L6.12234 13.9867C5.8862 13.9002 5.68321 13.7417 5.54206 13.5335C5.4009 13.3254 5.32871 13.0781 5.33568 12.8267C5.33588 12.5762 5.41623 12.3324 5.56498 12.1309C5.71372 11.9294 5.92305 11.7807 6.16234 11.7067L25.069 5.40005C25.2861 5.31158 25.5241 5.28788 25.7544 5.33182C25.9846 5.37576 26.1972 5.48545 26.3665 5.64764C26.5357 5.80982 26.6543 6.01756 26.708 6.24574C26.7617 6.47391 26.7482 6.71275 26.669 6.93339Z"
                  fill="#FFBC57"
                />
              </svg>
              <p className={style.route__text}>{route.text}</p>
            </li>
          ))}
        </ul>

        <ul className={style.route__listButton}>
          <li className={style.route__itemButton}>
            <a href="https://www.google.com/maps/dir//Кровато,+Изяславский+переулок,+52,+Київ,+03169/@50.3962324,30.4230726,18z/data=!4m8!4m7!1m0!1m5!1m1!1s0x40d4c985b50a7e6d:0x3d3fa41b01332a2a!2m2!1d30.424114!2d50.3963197">
              <button
                data-aos="zoom-in"
                data-aos-duration="2950"
                className={style.route__button}
              >
                Прокласти маршрут
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  width="25"
                  height="24"
                  viewBox="0 0 25 24"
                  fill="none"
                >
                  <path
                    d="M21.82 5.05006L15.82 3.05005H15.75C15.7035 3.04538 15.6566 3.04538 15.61 3.05005H15.38H15.25H15.18L9.5 5.00005L3.82 3.05005C3.66962 3.00047 3.50961 2.9873 3.35314 3.01164C3.19667 3.03598 3.04822 3.09713 2.92 3.19005C2.79076 3.28207 2.68527 3.40352 2.61224 3.54436C2.53921 3.68521 2.50074 3.8414 2.5 4.00005V18.0001C2.49946 18.2097 2.56482 18.4142 2.68685 18.5847C2.80887 18.7552 2.98138 18.883 3.18 18.9501L9.18 20.9501C9.38145 21.0157 9.59856 21.0157 9.8 20.9501L15.5 19.0501L21.18 21.0001C21.2862 21.0145 21.3938 21.0145 21.5 21.0001C21.7091 21.003 21.9132 20.9361 22.08 20.8101C22.2092 20.718 22.3147 20.5966 22.3878 20.4557C22.4608 20.3149 22.4993 20.1587 22.5 20.0001V6.00005C22.5005 5.79041 22.4352 5.5859 22.3132 5.41543C22.1911 5.24495 22.0186 5.11714 21.82 5.05006ZM8.5 18.6101L4.5 17.2801V5.39005L8.5 6.72005V18.6101ZM14.5 17.2801L10.5 18.6101V6.72005L14.5 5.39005V17.2801ZM20.5 18.6101L16.5 17.2801V5.39005L20.5 6.72005V18.6101Z"
                    fill="white"
                  />
                </svg>
              </button>
            </a>
          </li>
        </ul>
      </div>
    </section>
  );
};
