export const BlogArticleMain = () => {
  return (
    <>
      <h1 className={style.article__title}>
        Оформлення вітальні. Які м'які меблі краще вибрати?
      </h1>
      <img className={style.article__box} href="" />
      <ul className={style.article__list__text}>
        <li className={style.article__item__text}>
          <p className={style.article__text}>
            Вітальня – це основна кімната у кожному будинку. Саме вона служить
            для прийому гостей, проведення часу всією сім'єю та просто для
            відпочинку у приємній теплій атмосфері. Оформляючи свій будинок та
            вітальню зокрема, всі намагаються зробити її максимально зручною,
            комфортною та красивою. Основним та центральним елементом оформлення
            вітальні, як і будь-якої іншої кімнати, є м'які меблі.
          </p>
          <p classNameName={style.article__second-text}>
            Будь-які меблі для вітальні повинні бути не тільки стильними і
            красивими, але і функціональними. На таких меблів має бути зручно та
            приємно відпочивати та приймати гостей. Однак сьогодні існує
            величезна різноманітність найрізноманітніших м'яких меблів для
            вітальні, яка підходить для кімнат різних розмірів і форм. На чому
            варто зупинити свій вибір? Як краще оформити свою вітальню, щоб вам
            було комфортно, а гості хотіли приходити до вас знову та знову?
          </p>
        </li>
      </ul>
    </>
  );
};
