import { Component } from "react";

import { QuestionItem } from "./QuestionItem";

import containerStyle from "../Container/Container.module.scss";
import style from "./Questions.module.scss";

// Щоб підключити цю секцію пишіть так: <Questions sectionId="..." />, id секції записаний в масиві нижче.

export class Questions extends Component {
  sectionsData = [
    {
      id: "bed-questions",
      title: "Питання, які часто задають про Ліжка",
      questions: [
        {
          id: "bed1",
          question: 'Яке ліжко краще підійде для "хрущьовки"?',
          answer: [
            'Для вашої "хрущьовки" – традиційного українського житла зі своєрідними архітектурними особливостями – вибір ліжка має бути розумним і практичним. KROVATO, український бренд ліжок, пропонує кілька порад. Враховуйте розміри кімнати.',
            'Краще замовити найбільше ліжко, яке не заважатиме пересуванню в кімнаті, ніж маленьке. Півторне ліжко (150 см) часто є оптимальним варіантом для "хрущьовки".',
            "Ергономічна форма: вибирайте ліжко зі спинкою, яке не займе багато місця, але забезпечить комфортний сон.",
            "Якість каркасу: зверніть увагу на якість складання каркаса. Він повинен бути надійним і довговічним.",
            "Висота ліжка: оберіть висоту, яка зручна для вас. Низькі ліжка підходять молодим людям, а старшим – вищі вироби або навіть ліжка подіуми.",
            'Замовте ліжко від KROVATO, щоб поєднати комфорт і стиль у вашій "хрущьовці".',
          ],
        },
        {
          id: "bed2",
          question: "Як підібрати розмір ліжка",
          answer: [
            "Односпальне ліжко — оптимальний варіант для сну однієї людини. Вироби представлені в декількох стандартних розмірах по ширині: 80-90, рідше — 100 сантиметрів.",
            "Полуторні ліжка нагадують односпальні, але зі збільшеною шириною — в середньому 120-140 сантиметрів. Меблі підійдуть для одиночного сну людям з великою статурою або для худорлявої пари.",
            "Двоспальне місце для сну відрізняється простором і комфортом для двох дорослих, а також сімей, в яких діти люблять засинати разом з батьками. Ширина ліжка — від 160 см при стандартній довжині, а в розмірі king size — понад 200 см.",
          ],
        },
        {
          id: "bed3",
          question:
            "У покупку ліжка входить її доставка, збирання та встановлення в кімнаті?",
          answer: [
            "KROVATO, український бренд ліжок, робить покупку ліжка максимально зручною для вас. Отже, придбавши ліжко від KROVATO, ви отримаєте:",
            "Безкоштовну доставку: ваше нове ліжко буде доставлено прямо до вашого під’їзду в Києві.",
            "Збирання та встановлення: не хвилюйтеся про складання – фахівці з KROVATO зберуть ліжко за вас.",
            "Якість і комфорт: ви отримаєте високоякісний виріб, який гармонійно впишеться в вашу кімнату.",
            "Таким чином, ви зможете насолоджуватися своїм новим ліжком без зайвих клопотів.",
          ],
        },
        {
          id: "bed4",
          question: "Найдешевші ліжка - це обов’язково погана якість?",
          answer: [
            "Найдешевші ліжка не обов’язково означають погану якість. KROVATO, український бренд ліжок, доводить, що це може бути міфом. Ось чому:",
            "Економія на матеріалах: низька ціна не завжди означає погану якість. KROVATO використовує екологічно чисті матеріали, щоб забезпечити комфорт і довговічність своїх виробів.",
            "Професійне виготовлення: навіть доступні ліжка можуть бути високо якісними, якщо їх виготовлено фахівцями з увагою до деталей.",
            "Дизайн і функціональність: KROVATO пропонує різноманітні моделі, включаючи ліжка з підйомним механізмом та ящиком для білизни. Це не тільки економічно, але й практично.",
            "Відгуки клієнтів: перегляньте відгуки покупців. KROVATO прагне задовольнити потреби своїх клієнтів, незалежно від бюджету.",
            "Таким чином, ви можете знайти якісне ліжко за доступною ціною від KROVATO",
          ],
        },
        {
          id: "bed5",
          question: "Можна замовити ліжко під свої розміри?",
          answer: [
            "“KROVATO” - це бренд, який розуміє, що кожна людина унікальна, і її ліжко повинно бути таким же.",
            "Ви можете замовити ліжко під свої розміри, відповідно до вашого комфорту та стилю. Незалежно від того, чи ви обираєте мінімалістичний дизайн чи елегантні форми, “KROVATO” готовий задовольнити ваші потреби.",
            "Ваше ідеальне ліжко чекає на вас!",
          ],
        },
      ],
    },
    {
      id: "return-questions",
      title: "У вас все ще залишилися питання?",
      questions: [
        {
          id: "return1",
          question: "Як повернути або обміняти замовлення?",
          answer: [
            'Якщо ви бажаєте повернути або обміняти замовлене ліжко в магазині "Krovato", будь ласка, зверніться до нашої служби підтримки протягом 14 днів з моменту покупки.',
            "Ми забезпечимо швидкий та зручний процес обміну або повернення, щоб ваш досвід покупок був приємним.",
            "Не забудьте додати до вашого запиту на повернення або обмін фотографії товару та його оригінальну упаковку, щоб ми могли забезпечити найкращий сервіс.",
          ],
        },
        {
          id: "return2",
          question: "Чи можна повернути/обміняти товар, якщо втрачено чек?",
          answer: [
            "Ми постараємося вам допомогти, навіть якщо відповідно до закону України про захист прав споживачів, при поверненні покупцем товару або відмові від наданої послуги продавцю подається заява про повернення коштів, до якого обов`язково додається квитанція, товарний або касовий чек, рахунок (розрахунковий документ), який підтверджує покупку товару (надання послуги).",
            "У нас ведеться облік всіх замовлень, тому клієнту достатньо знати номер замовлення, написати заяву і надати дані на кого був оформлений замовлення, що б ми могли ідентифікувати покупку.",
          ],
        },
        {
          id: "return3",
          question: "В який термін будуть повернуті гроші?",
          answer: [
            "У разі повернення товару, магазин “Krovato” гарантує відшкодування коштів протягом 14 днів з моменту отримання поверненого товару. Ми працюємо над тим, щоб процес повернення був максимально зручним і швидким для наших клієнтів.",
            "Будь ласка, надішліть товар у первісному стані з усіма документами, і ми забезпечимо оперативне повернення коштів.",
            "Зверніть увагу, що у випадку затримки повернення коштів, наша команда підтримки завжди готова допомогти та вирішити будь-які питання.",
          ],
        },
        {
          id: "return4",
          question: "Чи можна повернути кошти на іншу карту?",
          answer: [
            "У магазині “Krovato” ми завжди прагнемо забезпечити зручність та задоволення наших клієнтів.",
            "Якщо вам потрібно повернути кошти на іншу карту, будь ласка, зверніться до нашої служби підтримки з деталями вашого замовлення. Ми зможемо обробити повернення коштів на альтернативну карту, якщо це відповідає нашим умовам повернення.",
            "Дякуємо, що обрали “Krovato” для вашого комфорту та відпочинку.",
          ],
        },
      ],
    },
  ];

  render() {
    const { sectionId } = this.props;

    const currentSection = this.sectionsData.find(
      (section) => section.id === sectionId
    );
    
    return (
      <section className={style.questions}>
        <div className={`${containerStyle.container} ${style.questions__container}`}>
          <h2
            data-aos="zoom-out-right"
            data-aos-duration="1500"
            className={style.questions__title}
          >
            {currentSection.title}
          </h2>
        </div>
        <ul className={style.questions__list}>
          {currentSection.questions.map((item) => (
            <QuestionItem
              key={item.id}
              id={item.id}
              question={item.question}
              answer={item.answer}
            />
          ))}
        </ul>
      </section>
    );
  }
};
