import style from "./About.module.scss";
import { useState } from "react";

export const About = () => {
  const [isExpanded, setIsExpanded] = useState(false);

  const toggleExpand = () => {
    setIsExpanded(!isExpanded);
  };

  return (
    <div className={style.about}>
      <h2>KROVATO - коли потрібні якісні меблі за доступною ціною!</h2>
      
      <div className={style.content}>
        <p>Якщо в пошуковий рядок браузера ввести запит: «Куплю ліжко, шафу, диван», система видасть сотні продавців, що спеціалізуються з продажуцього товару. Але далеко не всі магазини та сайти в інтернеті можуть запропонувати такий самий різноманітний асортимент, як наша компанія. Та й з нашими цінами конкурувати можуть мало хто. Адже товар ми отримуємо безпосередньо від виробників, не переплачуючи за послуги посередників. До того ж,</p>
        
        <div className={`${style.expandableContent} ${isExpanded ? style.expanded : ''}`}>
          <p>продажі ми ведемо як онлайн, так і в салоні, при цьому ціна на асортимент онлайн та офлайн - однакова. Ми співпрацюємо тільки з найкращими вітчизняними та зарубіжними фабриками та компаніями, які отримали визнання покупців та експертів меблевої справи. Для нас важливо, щоб товар, який ми продаємо, відповідав міжнародним стандартам якості, був із сертифікованих матеріалів – довговічних, красивих та екологічно чистих. Ми з особливою ретельністю відбираємо пропозиції для каталогу: тому можемо поручитися за їхню якість і впевнено рекомендувати своїм клієнтам. У нас ви легко знайдете меблеві серії в класичному та модерному стилі, лінійки для оформлення житла в дусі романтики або скандинавського лаконізму. ..</p>
          
          <p>Наша компанія прагне задовольнити потреби найвимогливіших клієнтів, тому ми постійно розширюємо асортимент наших товарів і пропонуємо індивідуальний підхід до кожного покупця. Ми розуміємо, що кожен має свої унікальні уподобання і потреби, тому ми старанно вивчаємо ринок та впроваджуємо нові тенденції в дизайні та технологіях виробництва меблів. Наші спеціалісти завжди готові надати професійну консультацію щодо вибору меблів, підбору кольору та матеріалів, а також допомогти з плануванням інтер'єру. Ми пропонуємо індивідуальне замовлення меблів за вашими індивідуальними параметрами, щоб кожен клієнт міг отримати саме те, що відповідає його потребам і бажанням. Нехай ваш дім стане втіленням вашої уяви про комфорт та стиль, а меблі від нашої компанії допоможуть створити неповторну атмосферу затишку та гармонії. Обирайте якість та надійність разом з нами!</p>
        </div>
        
        <div className={`${style.fadeOverlay} ${isExpanded ? style.hidden : ''}`}></div>
      </div>
      
      <div className={style.bedButtonContainer} onClick={toggleExpand}>
        <div className={`${style.bedButton} ${isExpanded ? style.bedOpen : ''}`}>
          <div className={style.bedHeadboard}></div>
          <div className={style.bedFrame}></div>
          <div className={style.bedMattress}></div>
          <div className={style.bedPillow}></div>
          <div className={style.bedBlanket}></div>
        </div>
      </div>
    </div>
  );
};
