const agreePoints = [
    {id:1 , title:"Оформлення та Оплата:" , description:"При оформленні замовлення важливо вказати коректні контактні дані. Оплата може здійснюватися різними способами, включаючи банківські картки, електронні перекази та оплату при отриманні."},
    {id:2 , title:"Доставка та Монтаж:" , description:"Ми надаємо різні варіанти доставки, а також можливість монтажу меблів при доставці. Зазначте свої вподобання при оформленні замовлення, і ми зробимо все можливе для вашого зручного отримання покупки."},
    {id:3 , title:" Гарантія та Обслуговування:" , description:"Всі наші товари супроводжуються гарантією якості. У випадку виникнення проблем чи потреби у післяпродажному обслуговуванні, наш відділ обслуговування клієнтів завжди готовий допомогти."},
    {id:4 , title:"Повернення та Обмін:" , description:"Ми розуміємо, що іноді можуть виникнути ситуації, коли необхідно повернути або обміняти товар. Звертайтеся до наших фахівців, і ми зробимо все можливе для вирішення питань швидко та ефективно."},
    {id:5 , title:"Конфіденційність та Безпека:" , description:"Ми гарантуємо конфіденційність ваших персональних даних та забезпечуємо їхню безпеку. Ваш комфорт і безпека покупок у нас - наш пріоритет."}
]
export const AgreeTerms = () => {
    return(
        <div style={{padding:20}}>
        <h1 style={{marginBottom:20}}>Умови покупки</h1>
        <ul style={{display:"flex" , gap:20 , flexDirection:"column"}}>
        {agreePoints.map((point) => (
         <li key={point.id}>
          <p>{point.id}. {point.title}</p>
          <p>{point.description}</p>
         </li>
        ))}
        <p>Бажаємо вам приємних та безпечних покупок у нашому магазині. Дякуємо за вибір нас!</p>
        </ul>
        </div>
    )
}